EcSUHA/ESP32_Device/main/SCDE_Main.c

// smart connected device engine - main




#include "ProjectConfig.h"

#include <esp8266.h>
#include "freertos/FreeRTOS.h"
#include "esp_wifi.h"
#include "esp_system.h"
#include "esp_event.h"
#include "esp_event_loop.h"
#include "nvs_flash.h"
#include "driver/gpio.h"


#include <stdio.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event_loop.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "driver/ledc.h"
#include "lwip/err.h"
#include "lwip/arch.h"
#include "lwip/api.h"
#include "lwip/sockets.h"




#include "vfs.h"



#include "esp_task_wdt.h"


#include "SCDE_s.h"
#include "SCDE_Main.h"
#include "SCDE.h"

//#include "Espfs.h"



#include "scde_task.h"








//#include "esp_spi_flash.h"
//#include "esp_partition.h"
//#include "spiffs.h"
//#include "esp_spiffs.h"
//#include "ESP32_Platform_SPIFFS.h"







#include <freertos/FreeRTOS.h>
//#include <freertos/include/freertos/heap_regions.h>
#include <freertos/task.h>
#include <esp_event.h>
#include <esp_event_loop.h>
#include <esp_log.h>
#include <esp_system.h>
#include <esp_wifi.h>
//#include <esp_heap_alloc_caps.h>
#include <nvs_flash.h>

#include "scde_task.h"
#include "logging.h"
#include "sdkconfig.h"


LOG_TAG("SCDE_Main");









/* FreeRTOS event group to signal when we are connected & ready to make a request */
static EventGroupHandle_t wifi_event_group;

/* The event group allows multiple bits for each event,
 but we only care about one event - are we connected
 to the AP with an IP? */
//static const int CONNECTED_BIT = BIT0;

// test for debug
static const char *TAG = "example";


/*
 *  address of espfs file system binary - included by linker
 */
//extern uint32_t _binary_x_img_start;
//extern uint32_t _binary_espfs_img_start;
//extern const uint8_t espfs_img_start[] asm("_binary_espfs_img_start");



#define HTTPD_STACKSIZE 8000//1000
#define HTTPD_MAX_CONNECTIONS 10

/*#include <esp8266.h>
#include "httpd.h"
#include "platform.h"
#include "httpd-platform.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"*/





static int httpPort;
static int httpMaxConnCt;
static xQueueHandle httpdMux;


struct  RtosConnType{
	int fd;
	int needWriteDoneNotif;
	int needsClose;
	int port;
	char ip[4];
};

static RtosConnType rconn[HTTPD_MAX_CONNECTIONS];
































































/*
 *--------------------------------------------------------------------------------------------------
 *FName: SCDE_read_rom_uint8
 * Desc: Reads an uint8 from unaligned flash (to prevent exception)
 * Para: const uint8* addr -> prt to adress to read
 * Rets: uint8 -> read from flash
 *--------------------------------------------------------------------------------------------------
 */
uint8_t ICACHE_FLASH_ATTR
SCDE_read_rom_uint8(const uint8_t* addr)
  {

  uint32_t bytes;

  bytes = *(uint32_t*)((uint32_t)addr & ~3);

  return ((uint8_t*)&bytes)[(uint32_t)addr & 3];

  }



/*
 *--------------------------------------------------------------------------------------------------
 *FName: SCDE_read_rom_uint16
 * Desc: Reads an uint16 from unaligned flash (to prevent exception)
 * Para: const uint16* addr -> prt to adress to read
 * Rets: uint16 -> read from flash
 *--------------------------------------------------------------------------------------------------
 */
uint16_t ICACHE_FLASH_ATTR
SCDE_read_rom_uint16(const uint16_t* addr)
  {

  uint32_t bytes;

  bytes = *(uint32_t*)((uint32_t)addr & ~3);

  return ((uint16_t*)&bytes)[((uint32_t)addr >> 1) & 1];

  }
 

 //   os_printf("%d\r\n", read_rom_uint8(&data[0]));
   // os_printf("%d\r\n", read_rom_uint8(data + 13));
     //os_printf("%d\r\n", read_rom_uint16(&data16[1]));


/*
 *--------------------------------------------------------------------------------------------------
 *FName: os_memcpyplus
 * Desc: memcpy from unaligned flash to ram (to prevent exception)
 * Para: char *dst -> prt to destination
 *       char *src -> prt to source data in flash
 *       int len -> max len to copy
 * Rets: -/-
 *--------------------------------------------------------------------------------------------------
 */
void ICACHE_FLASH_ATTR
SCDE_memcpy_plus(char *dst
		,const char *src
		,int len)
  {

  while (len--) *dst++ = (char) SCDE_read_rom_uint8((uint8_t*)src++);

  }





























int ICACHE_FLASH_ATTR
httpdPlatSendData(ConnTypePtr conn, char *buff, int len)
{
	conn->needWriteDoneNotif=1;
	return (write(conn->fd, buff, len)>=0);
}



void ICACHE_FLASH_ATTR
httpdPlatDisconnect(ConnTypePtr conn)
{
	conn->needsClose=1;
	conn->needWriteDoneNotif=1; //because the real close is done in the writable select code
}




void 
httpdPlatDisableTimeout(ConnTypePtr conn)
{
	//Unimplemented for FreeRTOS
}



//Set/clear global httpd lock.
void ICACHE_FLASH_ATTR httpdPlatLock() {
	xSemaphoreTakeRecursive(httpdMux, portMAX_DELAY);
}



void ICACHE_FLASH_ATTR 
httpdPlatUnlock()
{
	xSemaphoreGiveRecursive(httpdMux);
}





/**
 * -------------------------------------------------------------------------------------------------
 *  FName: platHttpServerTask
 *  Desc: 
 *  Info: 
 *  Para: -/- 
 *  Rets: -/-
 * -------------------------------------------------------------------------------------------------
 */
#define RECV_BUF_SIZE 2048
static void 
platHttpServerTask(void *pvParameters)
{
  int32_t listenfd;
  int32_t remotefd;
  int32_t len;
  int32_t ret;
  int x;
  int maxfdp = 0;
  char *precvbuf;
  fd_set readset,writeset;
  struct sockaddr name;

