EcSUHA/ESP32_Device/main/SCDE_Main.c
//http://www.thegeekstuff.com/2012/05/c-mutex-examples/

static xQueueHandle SCDEMux;






/*
 * --------------------------------------------------------------------------------------------------
 *  FName: Platform_IdleCbTask
 *  Desc: Task that provides the Idle-Callbacks
 *  Para: void *pvParameters -> ?
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
static void
IdleCbTask(void *pvParameters)
{
  Entry_Definition_t* p_entry_definition;

  // endless loop - blocked by an delay
  while(1) {
/*
	printf("\nNow IdleCbs>");

	// loop through definitions
	STAILQ_FOREACH(p_entry_definition, &SCDERoot.HeadCommon_Definitions, entries) {

		// check if F_WANTS_IDLE_TASK is set and IdleCbFn Fn is installed
		if ( (p_entry_definition->module->provided->IdleCbFn)
			&& (p_entry_definition->Common_CtrlRegA & F_WANTS_IDLE_TASK) ) {

			 os_printf("SCDE: Exec IdleCbFn!! Type-Name:%.*s Def-Name:%.*s FD:%d\n",
				p_entry_definition->module->provided->typeNameLen,
				p_entry_definition->module->provided->typeName,
				p_entry_definition->nameLen,
				p_entry_definition->name,
				p_entry_definition->fd);

			// clear Flag F_WANTS_WRITE, should be set again when more data should be sended
			p_entry_definition->Common_CtrlRegA &= ~F_WANTS_IDLE_TASK;

			// execute the idle callback function
			p_entry_definition->module->provided->IdleCbFn(p_entry_definition);
		}
	}
*/
	vTaskDelay(100 / portTICK_PERIOD_MS);
  }
}



/*
 * --------------------------------------------------------------------------------------------------
 *  FName: Platform_SelectQueryTask
 *  Desc: Task that selects the FD (read,write,exception) and creates read + write + exept. callbacks
 *  Para: void *pvParameters -> ?
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
static void
SelectQueryTask(void *pvParameters)
{
  Entry_Definition_t* p_entry_definition;
  int sd;

  // helper to finding highest file descriptor
  int max_fdp;

  // read socket descriptors set
  fd_set readfds;

  // write socket descriptors set
  fd_set writefds;

  // exception socket descriptors set
  fd_set exceptfds;

  os_printf("debug1:%d  2:%d.\n",
	FD_SETSIZE,
	sizeof(readfds) );

  struct timeval timeout;
  // Initialize the timeout data structure
    timeout.tv_sec = 0;		// seconds;
    timeout.tv_usec = 100000;	// microseconds

  // ???
  SCDEMux = xSemaphoreCreateRecursiveMutex();

  // ??
  int ret;
	
  os_printf("SCDE: startig global select loop.\n");

  // endless loop - blocked by select (depends on sets)
  while(1) {
/*
	// list currently stored modules
	printf("Selectloop: heap:%d\n",heap_caps_get_free_size(MALLOC_CAP_8BIT));

	Entry_Definition_t *Common_Definition;
	STAILQ_FOREACH(Common_Definition, &SCDERoot.HeadCommon_Definitions, entries) {
		printf("L Module:%.*s Name:%.*s FD:%d\n",
			Common_Definition->module->provided->typeNameLen,
			Common_Definition->module->provided->typeName,
			Common_Definition->nameLen,
			Common_Definition->name,
			Common_Definition->fd);
	}
*/
	// clear highest file descriptor
	max_fdp = 0;

	// clear the read socket set
	FD_ZERO (&readfds);

	// clear the write socket set
	FD_ZERO (&writefds);

	// clear the exception socket set
	FD_ZERO (&exceptfds);

	// loop through definitions with a valid socket descriptor to add to FD to sets
	STAILQ_FOREACH (p_entry_definition, &SCDERoot.HeadCommon_Definitions, entries) {

		// file descriptor / socket descriptor of this definition
		sd = p_entry_definition->fd;

		// if valid socket descriptor then may be we need to add to sets
		if ( sd != -1 ) {

/*			 os_printf("SCDE: adding %.*s fd:%d\n",
				p_entry_definition->nameLen,
				p_entry_definition->name,
				p_entry_definition->fd);
*/
			// select for reading, but only if an Fn is installed
			if (p_entry_definition->module->provided->DirectReadFn) {

				FD_SET (sd , &readfds);
			}

			// select for writing (if wants to write), but only if an Fn is installed
			if  ( (p_entry_definition->Common_CtrlRegA & F_WANTS_WRITE)
				&& (p_entry_definition->module->provided->DirectWriteFn) ) {

				FD_SET (sd , &writefds);
			}

			// select for exceptions, but only if an Fn is installed
			if (p_entry_definition->module->provided->ExceptFn) {

				FD_SET (sd , &exceptfds);
			}

			// find highest file descriptor number, need it for the select function
			// calculation after each FD_SET?
			if (sd > max_fdp) max_fdp = sd;
		}
	}

	// execute the selection
	ret = select (max_fdp + 1, &readfds, &writefds, &exceptfds, &timeout);

//	 os_printf("|SCDE: passed global select>");

	// did we get any?
	if ( ret > 0 ) {

//		 os_printf("SCDE: got any fd from select\n");
/*problem mit gelöschter definition?
		// loop through definitions with a valid socket descriptor to check and execute callbacks
		STAILQ_FOREACH(p_entry_definition, &SCDERoot.HeadCommon_Definitions, entries) {

			 os_printf("SCDE: ok fnd select\n");

			// file descriptor / socket descriptor of this definition
			sd = p_entry_definition->fd;

			// if valid socket descriptor then check and execute callbacks
			if (sd != -1) {

				// first check for write availability, but only if 'F_WANTS_WRITE' and 'DirectWriteFn' is installed
				if ( ( p_entry_definition->Common_CtrlRegA & F_WANTS_WRITE ) &&
					( p_entry_definition->module->provided->DirectWriteFn ) &&
					( FD_ISSET(sd , &writefds) ) ) {

					// clear Flag F_WANTS_WRITE, should be set again when more data should be sended
					p_entry_definition->Common_CtrlRegA &= ~F_WANTS_WRITE;

					// execute the write function
					p_entry_definition->module->provided->DirectWriteFn(p_entry_definition);
				}

				// second check for read availability. But only if a function is installed
				if ( (p_entry_definition->module->provided->DirectReadFn) &&
					(FD_ISSET(sd , &readfds)) ) {

					// execute the read function
					p_entry_definition->module->provided->DirectReadFn(p_entry_definition);
				}

				// third check for exceptions. But only if a function is installed
				if ( (p_entry_definition->module->provided->ExceptFn) &&
					(FD_ISSET(sd , &exceptfds)) ) {

					// execute the exception function
					p_entry_definition->module->provided->ExceptFn(p_entry_definition);
				}
			}
		}
*/
// --------------------------------------------------------------------------------------------------

		Entry_Definition_t* p_next_entry_definition;

		// first the write availability
//		os_printf("SCDE: check: in writeset?\n");

		p_entry_definition = STAILQ_FIRST(&SCDERoot.head_definition);

		while (p_entry_definition != NULL) {

			// load next, because current may be deleted during call
			p_next_entry_definition = STAILQ_NEXT(p_entry_definition, entries);

