EcSUHA/ESP32_Device/main/SCDE_Main.c
			// file descriptor / socket descriptor of this definition
			sd = p_entry_definition->fd;

			// if valid socket descriptor then check and execute callbacks
			if (sd != -1) {

				// first check for write availability, but only if 'F_WANTS_WRITE' and 'DirectWriteFn' is installed
				if ( ( p_entry_definition->Common_CtrlRegA & F_WANTS_WRITE ) &&
					( p_entry_definition->module->provided->DirectWriteFn ) &&
					( FD_ISSET(sd , &writefds) ) ) {

					// clear Flag F_WANTS_WRITE, should be set again when more data should be sended
					p_entry_definition->Common_CtrlRegA &= ~F_WANTS_WRITE;

					// execute the write function
					p_entry_definition->module->provided->DirectWriteFn(p_entry_definition);
				}
			}

			esp_task_wdt_reset();

			// nexi is already buffered
			p_entry_definition = p_next_entry_definition;
		}


		// second the read availability
//		os_printf("SCDE: check: in readset?\n");

		p_entry_definition = STAILQ_FIRST(&SCDERoot.head_definition);

		while (p_entry_definition != NULL) {

			// load next, because current may be deleted during call
			p_next_entry_definition = STAILQ_NEXT(p_entry_definition, entries);

			// file descriptor / socket descriptor of this definition
			sd = p_entry_definition->fd;

			// if valid socket descriptor then check and execute callbacks
			if (sd != -1) {

				// second check for read availability. But only if a function is installed
				if ( (p_entry_definition->module->provided->DirectReadFn) &&
					(FD_ISSET(sd , &readfds)) ) {

					// execute the read function
					p_entry_definition->module->provided->DirectReadFn(p_entry_definition);
				}
			}

			esp_task_wdt_reset();

			// nexi is already buffered
			p_entry_definition = p_next_entry_definition;
		}

		// third the write availability
//		os_printf("SCDE: check: in exeptset?\n");

		p_entry_definition = STAILQ_FIRST(&SCDERoot.head_definition);

		while (p_entry_definition != NULL) {

			// load next, because current may be deleted during call
			p_next_entry_definition = STAILQ_NEXT(p_entry_definition, entries);

			// file descriptor / socket descriptor of this definition
			sd = p_entry_definition->fd;

			// if valid socket descriptor then check and execute callbacks
			if (sd != -1) {

				// third check for exceptions. But only if a function is installed
				if ( (p_entry_definition->module->provided->ExceptFn) &&

					(FD_ISSET(sd , &exceptfds)) ) {

					// execute the exception function
					p_entry_definition->module->provided->ExceptFn(p_entry_definition);
				}
			}

			// nexi is already buffered
			p_entry_definition = p_next_entry_definition;
		}

// --------------------------------------------------------------------------------------------------

	}




//temp here 1sek cycle
	printf("\nNow IdleCbs>");

	// loop through definitions
	STAILQ_FOREACH(p_entry_definition, &SCDERoot.HeadCommon_Definitions, entries) {

		// check if F_WANTS_IDLE_TASK is set and IdleCbFn Fn is installed
		if ( (p_entry_definition->module->provided->IdleCbFn)

			&& (p_entry_definition->Common_CtrlRegA & F_WANTS_IDLE_TASK) ) {

			 os_printf("SCDE: Exec IdleCbFn!! Type-Name:%.*s Def-Name:%.*s FD:%d\n",
				p_entry_definition->module->provided->typeNameLen,
				p_entry_definition->module->provided->typeName,
				p_entry_definition->nameLen,
				p_entry_definition->name,
				p_entry_definition->fd);

			// clear Flag F_WANTS_WRITE, should be set again when more data should be sended
			p_entry_definition->Common_CtrlRegA &= ~F_WANTS_IDLE_TASK;

			// execute the idle callback function
			p_entry_definition->module->provided->IdleCbFn(p_entry_definition);
		}
	}
//temp here

  }
}



































/*
 *  Main entry point for ESP32 into the application.
 */
int
app_main(void)
{
  LOGD("Free heap at start: %d", esp_get_free_heap_size());

#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); //disable brownout detector    

 // LOGD("Free IRAM: %d",  xPortGetFreeHeapSizeTagged(MALLOC_CAP_32BIT));

//--------------------------------------------------------------------------------------------------

  //Initialize NVS
  esp_err_t ret = nvs_flash_init();

  // Error ? -> init nvs
  if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {

	ESP_ERROR_CHECK(nvs_flash_erase());

	ret = nvs_flash_init();
  }

  ESP_ERROR_CHECK(ret);

//--------------------------------------------------------------------------------------------------

  // init the SCDE-Engine (ROOT data)
  InitSCDERoot();

  // Now we can use the LogFn, say hello
  Log3( (const uint8_t*)"test!!!"
  		,4 //chck
		,1
		,"Test:%.*s\n"
		,3
		,TAG);

  // --------------------------------------------------------------------------------------------------
































#include "esp_err.h"
#include "esp_log.h"
#include "esp_spiffs.h"






// -------------------------------------------------------------------------------------------------
// initialize SPIFFS

  // initialize SPIFFS at path ??? 
  ESP_LOGI(TAG, "Initializing SPIFFS");
    
  esp_vfs_spiffs_conf_t conf = {
 	.base_path = "/spiffs",
	.partition_label = NULL,
	.max_files = 5,
	.format_if_mount_failed = true
  };

  // register SPIFFS
  //esp_err_t ret = esp_vfs_spiffs_register(&conf);
  ret = esp_vfs_spiffs_register(&conf);
  if (ret != ESP_OK) {
	if (ret == ESP_FAIL) {

		ESP_LOGE(TAG, "Failed to mount or format filesystem");

	} else if (ret == ESP_ERR_NOT_FOUND) {

		ESP_LOGE(TAG, "Failed to find SPIFFS partition");

	} else {

		ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(ret));

	}

	return;
  }

  // get SPIFFS infos
  size_t total = 0, used = 0;

  ret = esp_spiffs_info(NULL, &total, &used);

  if (ret != ESP_OK) {

	ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
  } else {

