EcSUHA/ESP32_Device/main/SCDE_Main.c
  ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);

  }




#include "esp_system.h"
#include "esp_spi_flash.h"

#ifdef CONFIG_IDF_TARGET_ESP32
#define CHIP_NAME "ESP32"
#endif

#ifdef CONFIG_IDF_TARGET_ESP32S2BETA
#define CHIP_NAME "ESP32-S2 Beta"
#endif

    /* Print chip information */
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    printf("This is %s chip with %d CPU cores, WiFi%s%s, ",
            CHIP_NAME,
            chip_info.cores,
            (chip_info.features & CHIP_FEATURE_BT) ? "/BT" : "",
            (chip_info.features & CHIP_FEATURE_BLE) ? "/BLE" : "");

    printf("silicon revision %d, ", chip_info.revision);

    printf("%dMB %s flash\n", spi_flash_get_chip_size() / (1024 * 1024),
            (chip_info.features & CHIP_FEATURE_EMB_FLASH) ? "embedded" : "external");







// -------------------------------------------------------------------------------------------------
// embedd commands A-Z

  // Activate Add as SCDE built-in Command
//  extern ProvidedByCommand_t Add_ProvidedByCommand;
//  CommandActivateCommand(&Add_ProvidedByCommand);

  // Activate Attr as SCDE built-in Command
  extern ProvidedByCommand_t Attr_ProvidedByCommand;
  CommandActivateCommand(&Attr_ProvidedByCommand);

  // Activate Define as SCDE built-in Command
  extern ProvidedByCommand_t Define_ProvidedByCommand;
  CommandActivateCommand(&Define_ProvidedByCommand);

  // Activate Deleteattr as SCDE built-in Command
  extern ProvidedByCommand_t Deleteattr_ProvidedByCommand;
  CommandActivateCommand(&Deleteattr_ProvidedByCommand);

  // Activate Delete as SCDE built-in Command
  extern ProvidedByCommand_t Delete_ProvidedByCommand;
  CommandActivateCommand(&Delete_ProvidedByCommand);

  // Activate Get as SCDE built-in Command
  extern ProvidedByCommand_t Get_ProvidedByCommand;
  CommandActivateCommand(&Get_ProvidedByCommand);

  // Activate Help as SCDE built-in Command
  extern ProvidedByCommand_t Help_ProvidedByCommand;
  CommandActivateCommand(&Help_ProvidedByCommand);

  // Activate Include as SCDE built-in Command
  extern ProvidedByCommand_t Include_ProvidedByCommand;
  CommandActivateCommand(&Include_ProvidedByCommand);

  // Activate IOWrite as SCDE built-in Command
  extern ProvidedByCommand_t IOWrite_ProvidedByCommand;
  CommandActivateCommand(&IOWrite_ProvidedByCommand);

  // Activate List as SCDE built-in Command
  extern ProvidedByCommand_t List_ProvidedByCommand;
  CommandActivateCommand(&List_ProvidedByCommand);

  // Activate Rename as SCDE built-in Command
  extern ProvidedByCommand_t Rename_ProvidedByCommand;
  CommandActivateCommand(&Rename_ProvidedByCommand);

  // Activate Rereadcfg as SCDE built-in Command
  extern ProvidedByCommand_t Rereadcfg_ProvidedByCommand;
  CommandActivateCommand(&Rereadcfg_ProvidedByCommand);

  // Activate Save as SCDE built-in Command
  extern ProvidedByCommand_t Save_ProvidedByCommand;
  CommandActivateCommand(&Save_ProvidedByCommand);

  // Activate Set as SCDE built-in Command
  extern ProvidedByCommand_t Set_ProvidedByCommand;
  CommandActivateCommand(&Set_ProvidedByCommand);

  // Activate Setstate as SCDE built-in Command
  extern ProvidedByCommand_t Setstate_ProvidedByCommand;
  CommandActivateCommand(&Setstate_ProvidedByCommand);

  // Activate Shutdown as SCDE built-in Command
  extern ProvidedByCommand_t Shutdown_ProvidedByCommand;
  CommandActivateCommand(&Shutdown_ProvidedByCommand);

  // Activate Sub as SCDE built-in Command
//  extern ProvidedByCommand_t Sub_ProvidedByCommand;
//  CommandActivateCommand(&Sub_ProvidedByCommand);

// -------------------------------------------------------------------------------------------------
// embedd modules A-Z (we have no file system to load)

  // --- the required module

  // Activate Global as SCDE built-in Module
  extern ProvidedByModule_t Global_ProvidedByModule;
  CommandActivateModule(&Global_ProvidedByModule);

  // --- now the optional modules

  // Activate ESP32_DeVICE as SCDE built-in Module
  extern ProvidedByModule_t ESP32_DeVICE_ProvidedByModule;
  CommandActivateModule(&ESP32_DeVICE_ProvidedByModule);

  // Activate Telnet as SCDE built-in Module
  extern ProvidedByModule_t Telnet_ProvidedByModule;
  CommandActivateModule(&Telnet_ProvidedByModule);

// -------------------------------------------------------------------------------------------------
// initialize the global definition

  // for response msg from AnalyzeCommand
//  struct headRetMsgMultiple_s headRetMsgMultiple;

//  #define CMD_4_GLOBAL "define Global Global"
//  headRetMsgMultiple = AnalyzeCommand((const uint8_t*) CMD_4_GLOBAL, 20);//sizeof(CMD_4_TELNET));

  String_t x = { (const uint8_t*) "define Global Global", 20};
  struct Head_String_s head_ret_msg = AnalyzeCommand(x);

  // temp conversion start
  struct headRetMsgMultiple_s headRetMsgMultiple;
  STAILQ_INIT(&headRetMsgMultiple);
  headRetMsgMultiple.stqh_first =  head_ret_msg.stqh_first;
  headRetMsgMultiple.stqh_last =  head_ret_msg.stqh_last;
// temp conversion end


  // retMsgMultiple stailq filled ?
  if (!STAILQ_EMPTY(&headRetMsgMultiple)) {

	// for the retMsg elements
	strTextMultiple_t *retMsg;

	// get the entries till empty
	while (!STAILQ_EMPTY(&headRetMsgMultiple)) {

		retMsg = STAILQ_FIRST(&headRetMsgMultiple);

		Log3( (const uint8_t*)"xxx"
			 ,sizeof("xxx")
			 ,1
			 ,"result is:%.*s\n"
			 ,retMsg->strTextLen
			,retMsg->strText);

		// done, remove this entry
		STAILQ_REMOVE(&headRetMsgMultiple, retMsg, strTextMultiple_s, entries);

		// free the msg-string
		free(retMsg->strText);

		// and the strTextMultiple_t
		free(retMsg);
	}
  }

//--------------------------------------------------------------------------------------------------

  // vTaskDelay(1000 / portTICK_PERIOD_MS);
  Log("Plat_ESP32",10,"MainFn inits SCDE.");

  // Init / start SCDE Core ...
  InitA();

//  vTaskDelay(1000 / portTICK_PERIOD_MS);

//--------------------------------------------------------------------------------------------------

  Log("Plat_ESP32",10,"MainFn starts SelectQueryTask.");

  // Start SCDE Select-Query loop
  xTaskCreatePinnedToCore(&SelectQueryTask
	,"SelQuery"
	,8048
	,NULL
	,4
	,NULL
	,0);

  // start idle-callbacks loop
  xTaskCreatePinnedToCore(&IdleCbTask
	,"IdleCb"
	,8048
	,NULL
	,5
	,NULL
	,0);

 /*
  xTaskCreate(SelectQueryTask
	,(const char *)"SelQuery"
	,HTTPD_STACKSIZE
	,NULL
	,4
	,NULL);
*/

  Log("Plat_ESP32",10,"MainFn reaches while(0).");

  // dont now what to do here ...
  while (true) {
	vTaskDelay(300 / portTICK_PERIOD_MS);
  }

  return 0;
}

